{
	"community": [
		{
			"message": "You fixed a bug of your garbage collector.",
			"earn": 100
		},
		{
			"message": "You restart your program.",
			"go_to": 0,
			"earn": 200
		},
		{
			"message": "Your git pull is bigger than you thought.",
			"earn": -50
		},
		{
			"message": "You delete old repositories.",
			"earn": 50
		},
		{
			"message": "HTTP/502 Bad Gateway",
			"go_to": -2
		},
		{
			"message": "You have programmed something good and received a donation that allows you to host your program externally.",
			"earn": 100
		},
		{
			"message": "Finally, your data-intensive program is finished with the calculation.",
			"earn": 20
		},
		{
			"message": "You make some optimizations to your program.",
			"earn": 100
		},
		{
			"message": "You create a comprehensive syntax highlighting package for your programming language.",
			"earn": -50
		},
		{
			"message": "You need more memory for your data.",
			"earn": -50
		},
		{
			"message": "You delete plugins that you never use.",
			"earn": 25
		},
		{
			"message": "You remove whitespace characters from your JSON files.",
			"earn": 10
		},
		{
			"message": "You delete one of the many IDEs/editors that you hardly ever open.",
			"earn": 100
		}
	],
	"chance": [
		{
			"message": "Your program crashed.",
			"go_to": 0,
			"earn": 200
		},
		{
			"message": "Your educational institution wants you to use this programming language.",
			"go_to": 24
		},
		{
			"message": "HTTP/307 Temporary Redirect. The ancient project that is assigned to you uses this programming language.",
			"go_to": 11
		},
		{
			"message": "HTTP/101 Switching Protocols",
			"go_to": 5
		},
		{
			"message": "HTTP/101 Switching Protocols",
			"go_to": 15
		},
		{
			"message": "HTTP/101 Switching Protocols",
			"go_to": 25
		},
		{
			"message": "HTTP/101 Switching Protocols",
			"go_to": 35
		},
		{
			"message": "You receive many upvotes for your question. Your friends think you're so cool that they offer to let you use their storage.",
			"earn": 50
		},
		{
			"message": "You get hundreds of downvotes for your question. Your self-confidence drops so low that you go into isolation on your own to avoid committing any more code crimes. (You'll get better soon, believe me.)",
			"go_to": -2
		},
		{
			"message": "It's time to move on to more advanced programming languages.",
			"go_to": 39
		},
		{
			"message": "HTTP/402 Payment Required",
			"earn": -150
		},
		{
			"message": "You help someone with a lot of downvotes with a nice comment. The karma pays off, as you realize through your research how you can fix self-pointing pointers not being garbage collected.",
			"earn": 150
		}
	]
}